# х1=int(input('введите первое число '))
# х2=int(input('введите втторое число '))
# print('Сумма чисел', х1+х2)
'''Напишите программу, вычисляющую площадь ромба. Пользователь с клавиатуры вводит длину двух его диагоналей'''
х1=int(input(' введите значение стороны ромба '))
x2=int(input(' введите значение высоты ромба '))
print('произведение чисел' , х1*x2)