'''Задание 1
Пользователь вводит с клавиатуры три числа.
В зависимости от выбора пользователя программа выводит на экран сумму трёх чисел или произведение трёх чисел.'''
# x1 = int(input("Введите первое число: "))
# x2 = int(input("Введите второе число: "))
# x3 = int(input("Введите третье число: "))
# n = int(input("Введите 1 если необходимо получить сумму чисел \nВведите 2 если необходимо получить произведение чисел: "))
# if n == 1:
#     print('Сумма чисел', x1+x2+x3)
# elif n == 2:
#     print('Произведение чисел', x1*x2*x3)
# else:
#     print('Введено неверное значение. Введите "1", "2"')
'''Задание 2
Пользователь вводит с клавиатуры три числа. В зависимости от выбора пользователя программа выводит
на экран максимум из трёх, минимум из трёх или среднеарифметическое трёх чисел'''
# x1 = int(input("Введите первое число: "))
# x2 = int(input("Введите второе число: "))
# x3 = int(input("Введите третье число: "))
# n = int(input("Введите 1 если необходимо вывести наибольшее число \nВведите 2 еесли необходимо вывести наименьшее число\nВведите 3 для нахождения среднего значения введеных чисел: "))
# if n == 1:
#     print('Наибольшее число', max(x1,x2,x3))
# elif n == 2:
#     print('Наименьшее число', min(x1,x2,x3))
# elif n==3:
#     print('Среднеарифметическое трёх чисел', (x1+x2+x3)/3)
# else:
#     print('Введено неверное значение. Введите "1", "2", "3"')
'''Задание 3
Пользователь вводит с клавиатуры количество метров. В зависимости от выбора пользователя программа переводит метры в мили, дюймы или ярды.'''
y = int(input("Введите число в метрах: "))
n = int(input("Введите 1 для перевода в мили\nВведите 2 для перевода в дюймы\nВведите 3 для перевода в ярды: "))
# if n==1:
#     print('Мили', y*0.00062137)
# elif n==2:
#     print('Дюймы', y/0.0254)
# elif n==3:
#     print('Ярды', y*1.0936)
# else:
#     print('Введено неверное значение. Введите "1", "2"')