'''Задание 1
Пользователь вводит с клавиатуры число. Необходимо проверить его на четность и нечетность. Если число
четное требуется вывести на экран число и надпись Even number. Если число нечетное выведите на экран число и
надпись Odd number.'''
# number= int(input("Введите число "))
# if number%2==0:
#     print(number, 'Even number')
# else:
#     print(number, 'Odd number')
'''Задание 2
Пользователь вводит с клавиатуры число. Необходимо проверить его на кратность 7. Если число кратно
требуется вывести на экран число и надпись Number is
multiple 7. Если число не кратно выведите на экран число
и надпись Number is not multiple 7. '''
# number= int(input("Введите число: "))
# if number%7==0:
#     print(number, 'Number is multiple 7')
# else:
#     print(number, 'Number is not multiple 7')
'''Задание 3
Пользователь вводит с клавиатуры два числа. Необходимо найти максимум из двух чисел и показать его на экран.'''
# number1= int(input("Введите первое число: "))
# number2= int(input("Введите второе число: "))
# largest_number = max(number1, number2)
# print('Наибольшее число', largest_number)
'''Задание 4
Пользователь вводит с клавиатуры два числа. Необходимо найти минимум из двух чисел и показать его на экран.'''
# number1= int(input("Введите первое число: "))
# number2= int(input("Введите второе число: "))
# largest_number = min(number1, number2)
# print('Наиеньшее число', largest_number)
'''Задание 5
Пользователь вводит с клавиатуры два числа. В зависимости от выбора пользователя нужно показать сумму
двух чисел, разницу двух чисел, среднеарифметическое или произведение двух чисел.'''
# number1= int(input("Введите первое число: "))
# number2= int(input("Введите второе число: "))
# a=number1+number2
# b=number2-number1
# c=(number1+number2)/2
# d=number1*number2
# n= int(input("Введите значение для получения: 1 - суммы двух чисел, 2 разницы двух чисел,\n3 - среднеарифметическое двух чисел,4 - произведение двух чисел: "))
# if n==1:
#     print('Сумма введенных чисел равна', a)
# elif n==2:
#     print('Разница введенных чисел равна', b)
# elif n==3:
#     print('Среднеарифметическое введенных чисел равна', c)
# elif n==4:
#     print('Произведение введенных чисел равна', d)
# else:
#     print('Введено неверное значение. Введите "1", "2", "3", "4"')