'''Задание 1
Пользователь вводит с клавиатуры строку. Произведите поворот строк и полученный результат выведите на экран.'''
# string= input('Введите строку: ')
# print(string[::-1])
'''Задание 2
Пользователь вводит с клавиатуры строку. Посчитайте количество букв, цифр в строке. Выведите оба количества на экран.'''
# string= input('Введите строку: ')
# b = sum(i.isalpha() for i in string)
# c = sum(i.isdigit() for i in string)
# print('Количество букв: {}'.format(b))
# print('Количество цифр: {}'.format(c))
'''Задание 3
Пользователь вводит с клавиатуры строку и символ для поиска. Посчитайте сколько раз в строке встречается
искомый символ. Полученное число выведите на экран'''
# string= input('Введите строку: ')
# symbol= input('Введите символ для поиска: ')
# x=string.count(symbol)
# if x>0:
#     print('Искомых символов в строке:', x)
# else:
#     print('Искомых символов в строке нет')
'''Задание 4
Пользователь вводит с клавиатуры строку и слово для поиска. Посчитайте сколько раз в строке встречается 
искомое слово. Полученное число выведите на экран.'''
# string= input('Введите строку: ')
# word= input('Введите слово для поиска: ')
# x=string.count(word)
# if x>0:
#     print('Искомых слов в строке:', x)
# else:
#     print('Искомых слов в строке нет')
'''Задание 5
Пользователь вводит с клавиатуры строку, слово для поиска, слово для замены. Произведите в строке замену одного слова на другое.
Полученную строку отобразите
на экране'''
# string= input('Введите строку: ')
# word= input('Введите слово для поиска: ')
# change = input('Введите слово для замены: ')
# x=string.replace(word,change)
# print(x)